Description: Packages the current Bitwarden-Desktop release.
Identifier: com.github.NickETH.recipes.build.Bitwarden-Desktop-Win64
ParentRecipe: com.github.NickETH.recipes.download.Bitwarden-Desktop-Win64
MinimumVersion: 1.3.1

Input:
  NAME: 'Bitwarden'
  NAMESHORT: 'Bitwarden'
  NAMELONG: Bitwarden-Desktop
  VENDOR: Bitwarden
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _ML

Process:
- Processor: com.github.jazzace.processors/TextSearcher
  Comment: Normalize the version tag by removing preceeding text
  Arguments:
    text_in: '%version%'
    re_pattern: '[\d\.]+'
    result_output_var_name: 'version'

- Processor: com.github.jazzace.processors/TextSearcher
  Comment: Create a version tag for the MSI package
  Arguments:
    text_in: '%version%'
    re_pattern: '(?<=^..).*$'
    result_output_var_name: 'msiversion'

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create a build enviroment to store the package
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourcepkt:sourceunzipped:release:read:helpers:wixproject:wixproject\Includes:wixproject\Resources:wixproject\Lang
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_%version%_ML'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '3'
    create_AS_ver: 'true'

- Processor: Copier
  Comment: Copy the Bitwarden-Desktop installer file to the build dir
  Arguments:
    destination_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\sourcepkt\%filename%'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the Bitwarden-Desktop NSIS installer to the sourceunzipped dir
  Arguments:
    exe_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\sourcepkt\%filename%'
    extract_dir: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\wixproject\%NAME%\'
    extract_file: '*'
    ignore_pattern: ''
    preserve_paths: 'True'

- Processor: PathDeleter
  Comment: Delete the app-update.yml file. This disables the Auto Update.
  Arguments:
    path_list: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\wixproject\%NAME%\resources\app-update.yml'

- Processor: com.github.haircut.processors/AppIconExtractor
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    source_app: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\wixproject\%NAME%\%NAME%.exe'
    #msi_icon_name: 'MainExecutableIcon.ico'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'

- Processor: com.github.NickETH.recipes.SharedProcessors/ResourceWorker
  Comment: Extract the Bitwarden-Desktop res file
  Arguments:
    exe_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\wixproject\%NAME%\%NAME%.exe'
    output_file: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\sourceunzipped\Icon-%NAME%.res'
    reswork_action: 'extract'
    reswork_cmd: 'ICONGROUP,,'
    # ignore_errors: 'True'

- Processor: com.github.NickETH.recipes.SharedProcessors/ResourceWorker
  Comment: Generate a new Icon.exe file for Bitwarden-Desktop
  Arguments:
    exe_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\helpers\Icon-Stub-1.exe'
    input_file: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\sourceunzipped\Icon-%NAME%.res'
    output_file: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\wixproject\Resources\Main-Icon.exe'
    reswork_action: 'add'
    reswork_cmd: 'ICONGROUP,,'
    # ignore_errors: 'True'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\read\create-log-%NAMELONG%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\read\readme-%NAMELONG%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/WixSettings
  Comment: Define variables for the WIX build process to the version.wxi file
  Arguments:
    preproc_file: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\wixproject\version.wxi'
    # template_file: None
    new_settings:
    - define: 'version="%msiversion%"'
    - define: 'ProductVersion="%msiversion%"'
    - define: 'Packagecode="{NNEEWWGGUUIIDD}"'
    - define: 'Productcode="{NNEEWWGGUUIIDD}"'
    - define: 'ProductName="!(loc.ProductName)"'
    - define: 'ProductNameWithVersion="!(loc.ProductName) $(var.version) $(var.Arch)"'
    - define: 'ProductLanguage="!(loc.ProductLanguage)"'
    - define: 'AppName="%NAME%"'
    - define: 'AppFolder="$(var.APInstallFolder)"'
    - define: 'AppVendor="%VENDOR%"'
    - define: 'ProductManufacturerShort="%VENDOR%"'
    - define: 'ProductUpgradeCode="{9238B0E9-FCA0-4586-B55D-F6F7FAA6AC46}"'
    - define: 'ProductManufacturerLong="%VENDOR%"'
    - define: 'RTMProductVersion="0.0.1"'
  
- Processor: com.github.NickETH.recipes.SharedProcessors/MSBuildRun
  Comment: Run the MSBuild script to generate the Bitwarden-Desktop MSI installer
  Arguments:
    build_file: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\wixproject\%NAME%.build'
    build_folder: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\wixproject'
    build_property: BuildPlatform=%PLATFORM%;BuildName=%NAME%;BuildDir=%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\wixproject;SourceDir=%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\wixproject\%NAME%;version=%msiversion%;versionlong=%version%;Platformstr=%PF_STRING%;LangStr=%LANG_STRING%
    #;"ASVersion=%AS_ver%"
    build_target: WIX
