Description: Download recipe for Bitwarden Desktop x64.
Identifier: com.github.NickETH.recipes.download.Bitwarden-Desktop-Win64
MinimumVersion: 1.3.1

Input:
  NAME: Bitwarden-Desktop
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    # bitwarden-2023.9.1-x64.nsis.7z
    asset_regex: bitwarden-([0-9]+\.)*[0-9]+-x64.nsis\.7z
    github_repo: bitwarden/clients

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-x64.7z'

- Processor: EndOfCheckPhase

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False
