Description: Imports Ghostscript x64 to BMS
Identifier: com.github.NickETH.recipes.BMS.Ghostscript-Win64
ParentRecipe: com.github.NickETH.recipes.build.Ghostscript-Win64
MinimumVersion: 1.3.1

Input:
  NAME: Ghostscript
  LONG_NAME: 'Ghostscript'
  VENDOR: 'Artifex'
  ASSET_REGEX: gs[0-9]+w64.exe
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _ML
  DIP_NAME: Ghostscript
  DIP_SUBDIR: ML
  PROC_CHAR: '%'

Process:
- Processor: com.github.jazzace.processors/TextSearcher
  Arguments:
    text_in: '%versionminor%00'
    re_pattern: '[0-9]{2}'
    result_output_var_name: versionminunist

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    version_uninstall: '%versionmajor%.%versionminunist%.%versionbuild%'
    input_string: '%build_ver%'
    pattern_replace:
    - pattern: \.
      repl: _

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS)
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,1641,3010\r\nDeinstall.CheckAppRC=0,1605,1641,3010"
    bms_app_installcmd: '{DIP}\Apl\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%\%NAME%%PF_STRING%_%build_ver%_ML.exe'
    bms_app_installparm: /S
    bms_app_integration:
    - appname: '%NAME%'
      currentversion:
        job: '@_nV_%NAME% - Update (DYN)'
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML (%PLATFORM%)'
        type: job
      jobs:
      - action: add
        name: '@_%NAME% - Update (DYN)'
        version: new
      - action: changetype
        name: '@_nV_%NAME% - Update (DYN)'
        version: previous
      platform: (%PLATFORM%)
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% ML'
    bms_app_iopt_copylocal: 'true'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'false'
    bms_app_name: '%NAME%'
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: '{%PROC_CHAR%ProgramW6432%PROC_CHAR%}\gs\gs%version_uninstall%\uninstgs.exe'
    bms_app_uninstparm: /S
    bms_app_valid4os: '%BMS_OS4X64%,%BMS_OS4SRV%'
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%build_ver% ML (x64)'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME%'
    inst_file_src_dest: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\release\*.exe|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\%DIP_NAME%\bms_app_integration.json'
    read_file_src_dest: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\read\*-%NAME%%PF_STRING%_%build_ver%_ML.txt|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%parsed_string%\DEV'

- Processor: EndOfCheckPhase
