Description: Alters latest Ghostscript x64 Install-file for Windows.
Identifier: com.github.NickETH.recipes.build.Ghostscript-Win64
ParentRecipe: com.github.NickETH.recipes.download.Ghostscript-Win64
MinimumVersion: 1.3.1

Input:
  NAME: Ghostscript
  VENDOR: 'Artifex'
  ASSET_REGEX: gs[0-9]+w64.exe
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _ML

Process:
# - Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  # Comment: Extract the .eclipseproduct file, which contains version info.
  # Arguments:
    # exe_path: '%pathname%'
    # extract_dir: '%RECIPE_CACHE_DIR%\downloads\'
    # extract_file: 'config.ini'
    # ignore_pattern: ''
    # recursive: 'True'
    # preserve_paths: 'False'

# - Processor: URLTextSearcher
  # Arguments:
    # #eclipse.buildId=4.27.0.20230309-1200
    # re_pattern: 'eclipse.buildId=(?P<version>[0-9]+\.[0-9]+\.[0-9]+)'
    # result_output_var_name: version
    # url: 'file://%RECIPE_CACHE_DIR%\downloads\config.ini'

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create a build enviroment to build the MSI with Wix
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    create_AS_ver: 'True'
    folder_list: sourcepkt:sourceunzipped:release:icons:read:helpers:wixproject:wixproject\Includes:wixproject\Resources:wixproject\Lang
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::_ML'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '3'

- Processor: Copier
  Comment: Copy the Eclipse installer files to the build dir
  Arguments:
    destination_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\sourcepkt\%filename%'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the autopkg zip archive
  Arguments:
    exe_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\sourcepkt\%filename%'
    # extract_dir: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\%NAME%'
    # extract_dir: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\gs\gs%build_ver%'
    extract_dir: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\gs%build_ver%'
    extract_file: '*'
    ignore_pattern: ''
    preserve_paths: 'True'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileMoverFromList
  Arguments:
    file_list: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\helpers\gs-remove-files.txt'
    source_dir: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\gs%build_ver%'
    target_dir: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\delete'

- Processor: PathDeleter
  Comment: Delete unnesessary folders from the Ghostscript installer directory
  Arguments:
    path_list:
    - '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\gs%build_ver%\$PLUGINSDIR'

# - Processor: FileMover
  # Comment: Rename the Ghostscript installer folder to the build dir
  # Arguments:
    # target: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\%NAME%\'
    # source: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\eclipse\'

- Processor: com.github.haircut.processors/AppIconExtractor
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    source_app: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\helpers\ghostscript_256.ico'
    #msi_icon_name: 'MainExecutableIcon.ico'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'

- Processor: com.github.NickETH.recipes.SharedProcessors/ResourceWorker
  Comment: Extract the Ghostscript res file
  Arguments:
    # exe_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\gs\gs%build_ver%\bin\gswin64.exe'
    # exe_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\%NAME%\bin\gswin64.exe'
    exe_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\gs%build_ver%\bin\gswin64.exe'
    output_file: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\sourceunzipped\Icon-%NAME%.res'
    reswork_action: 'extract'
    reswork_cmd: 'ICONGROUP,,'
    # ignore_errors: 'True'

- Processor: com.github.NickETH.recipes.SharedProcessors/ResourceWorker
  Comment: Generate a new Icon.exe file for Ghostscript
  Arguments:
    exe_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\helpers\Icon-Stub-1.exe'
    input_file: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\sourceunzipped\Icon-%NAME%.res'
    output_file: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\Resources\Main-Icon.exe'
    reswork_action: 'add'
    reswork_cmd: 'ICONGROUP,,'
    # ignore_errors: 'True'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\read\create-log-%NAME%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\read\readme-%NAME%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/WixSettings
  Comment: Define variables for the WIX build process to the version.wxi file
  Arguments:
    preproc_file: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\version.wxi'
    # template_file: None
    new_settings:
    - define: 'version="%build_ver%"'
    - define: 'ProductVersion="%build_ver%"'
    - define: 'Packagecode="{NNEEWWGGUUIIDD}"'
    - define: 'Productcode="{NNEEWWGGUUIIDD}"'
    - define: 'ProductName="!(loc.ProductName)"'
    - define: 'ProductNameWithVersion="!(loc.ProductName) $(var.version) $(var.Arch)"'
    - define: 'ProductLanguage="!(loc.ProductLanguage)"'
    - define: 'AppName="%NAME%"'
    - define: 'AppFolder="$(var.APInstallFolder)"'
    - define: 'AppVendor="%VENDOR%"'
    - define: 'ProductManufacturerShort="%VENDOR%"'
    - define: 'ProductUpgradeCode="{BDDC4482-2D44-4277-AC47-0C69A86A46E0}"'
    - define: 'ProductManufacturerLong="%VENDOR%"'
    - define: 'RTMProductVersion="0.0.1"'
  
- Processor: com.github.NickETH.recipes.SharedProcessors/MSBuildRun
  Comment: Run the MSBuild script to generate the Eclipse MSI installer
  Arguments:
    build_file: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\%NAME%.build'
    build_folder: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject'
    build_property: BuildPlatform=%PLATFORM%;BuildName=%NAME%;BuildDir=%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject;SourceDir=%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\gs%build_ver%;version=%build_ver%;Platformstr=%PF_STRING%;LangStr=%LANG_STRING%

    build_target: WIX
