Description: Downloads latest Adoptium IcedTea-Web MSI-file for Windows.
Identifier: com.github.NickETH.recipes.download.AdoptiumIcedTeaWeb-Win64
MinimumVersion: 1.3.1

Input:
  NAME: IcedTea-Web
  GITHUB_REPO: AdoptOpenJDK/IcedTea-Web
  PLATFORM: x64

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: icedtea-web-[0-9\.]+[0-9]\.msi
    github_repo: '%GITHUB_REPO%'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%_%PLATFORM%.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Comment: Get the version from the MSI file
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductVersion'
    msi_path: '%pathname%'

- Processor: EndOfCheckPhase
