Description: Alters latest Adoptium IcedTea-Web x64 MSI-file for Windows.
Identifier: com.github.NickETH.recipes.build.AdoptiumIcedTeaWeb-Win64
ParentRecipe: com.github.NickETH.recipes.download.AdoptiumIcedTeaWeb-Win64
MinimumVersion: 1.3.1

Input:
  NAME: IcedTea-Web
  VENDOR: Adoptium
  GITHUB_REPO: AdoptOpenJDK/IcedTea-Web
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourceunzipped:release:read
    org_ver: '%msi_value%'
    pkg_dir: '%VENDOR%_%NAME%%PF_STRING%_::VVeerrssiioonn::_ML'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%VENDOR%_%NAME%%PF_STRING%_%msi_value%_ML\read\create-log-%VENDOR%_%NAME%%PF_STRING%_%msi_value%_ML.txt'
    new_ver: '%msi_value%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%VENDOR%_%NAME%%PF_STRING%_%msi_value%_ML\read\readme-%VENDOR%_%NAME%%PF_STRING%_%msi_value%_ML.txt'
    new_ver: '%msi_value%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%VENDOR%_%NAME%%PF_STRING%_%msi_value%_ML\release\%VENDOR%_%NAME%%PF_STRING%_%msi_value%_ML.msi'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIApplySumInfo
  Arguments:
    cmnds_sinfo:
      /j: Adoptium %NAME% %PLATFORM% %msi_value% ML
      /o: Version %msi_value%. %us_date% by AutoPkg
      /t: Adoptium %NAME% %PLATFORM% %msi_value% ML
    msi_path: '%BUILD_DIR%\%VENDOR%_%NAME%%PF_STRING%_%msi_value%_ML\release\%VENDOR%_%NAME%%PF_STRING%_%msi_value%_ML.msi'

- Processor: EndOfCheckPhase
