Description: Imports Adoptium OpenJDK JRE x64 to BMS
Identifier: com.github.NickETH.recipes.BMS.AdoptiumOpenJRE8-Win64
ParentRecipe: com.github.NickETH.recipes.build.AdoptiumOpenJRE8-Win64
MinimumVersion: 1.3.1

Input:
  NAME: AdoptiumOpenJDK_JRE_Hotspot
  APPNAME: 'Adoptium Java RE'
  NAME_SHORT: 'Adoptium JRE'
  FILENAME: 'Adoptium_JRE'
  DOWNLOAD_FILE: OpenJDK8U-JRE
  FEATUREVER: '8'
  PLATFORM: x64
  ZULUPLATFORM: x64
  PRODUCT: jre
  SEARCH_URL: https://api.adoptium.net/v3/installer/latest/%FEATUREVER%/ga/windows/%PLATFORM%/%PRODUCT%/hotspot/normal/adoptium
  ADDON_NAME: JavaFX
  VENDOR: 'Eclipse'
  PF_STRING: '_64'
  LANG_STRING: _ML
  APPFOLDER: OpenJDK
  MAJOR_VERSION: '8'
  DIPNAME: OpenJDK
  DIP_SUBDIR: ML_x64

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductCode'
    msi_path: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\release\%FILENAME%%PF_STRING%_%build_ver%%LANG_STRING%.msi'

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%build_ver%'
    pattern_replace:
    - pattern: \.
      repl: _

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS)
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,1605,3010"
    bms_app_installcmd: '{DIP}\Apl\%DIPNAME%\%parsed_string%\%DIP_SUBDIR%\%FILENAME%%PF_STRING%_%build_ver%%LANG_STRING%.msi'
    bms_app_installparm: /qn /norestart ALLUSERS=1 ADDLOCAL=ALL
    bms_app_integration:
    - appname: '%APPNAME%'
      bundles:
      - action: exchange
        name: nV_%NAME_SHORT% %MAJOR_VERSION%.x
      - action: add
        name: aV_%NAME_SHORT% %MAJOR_VERSION%.x Uninstall
        version: new
      - action: add
        name: oV_%NAME_SHORT% %MAJOR_VERSION%.x Uninstall
        version: previous
      copyfolders: 1
      currentversion:
        bundle: nV_%NAME_SHORT% %MAJOR_VERSION%.x
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML (%PLATFORM%)'
        type: bundles
      platform: (%PLATFORM%)
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% ML'
    # bms_app_sharepoint:
    # - SW-List-Name: '%APPNAME%'
      # versionplatformtag: '%build_ver% ML (%PLATFORM%)'
    bms_job_kiosk:
    - jobname: '%NAME_SHORT%'
      substring: 'Taskkill'
      jobdescription: 'Adoptium Java Runtime is a certified build of OpenJDK. It can be used as 1:1 replacement of Oracle Java Runtime.'
      autoenableapp: '%APPNAME%%MAJOR_VERSION% - Enable AutoUpdate'
      autoreleasejob: '@_AU-Rel_%NAME_SHORT%%MAJOR_VERSION%'
    bms_app_iopt_copylocal: 'true'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'false'
    bms_app_iopt_usebbt: true
    bms_app_name: '%APPNAME%'
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: msiexec.exe
    bms_app_uninstparm: /x %msi_value% /qn
    bms_app_valid4os: '%BMS_OS4X64%,%BMS_OS4SRV%'
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%build_ver% ML (%PLATFORM%)'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME1%'
    inst_file_src_dest: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\release\*.*|%BMS_IMPORT_PATH_TST%\%DIPNAME%\%parsed_string%\%DIP_SUBDIR%'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\%DIPNAME%\bms_app_integration.json'
    icon_file_src: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\icons\*.*'
    read_file_src_dest: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\read\*-%FILENAME%%PF_STRING%_%build_ver%%LANG_STRING%.txt|%BMS_IMPORT_PATH_TST%\%DIPNAME%\%parsed_string%\DEV'

- Processor: EndOfCheckPhase
