Description: Alters latest Adoptium OpenJDK 8 JRE Hotspot x64 MSI-file for Windows.
Identifier: com.github.NickETH.recipes.build.AdoptiumOpenJRE8-Win64
ParentRecipe: com.github.NickETH.recipes.download.AdoptiumOpenJDKMSI-Win
MinimumVersion: 1.3.1

Input:
  NAME: AdoptiumOpenJDK_JRE_Hotspot
  FILENAME: 'Adoptium_JRE'
  DOWNLOAD_FILE: OpenJDK8U-JRE
  FEATUREVER: '8'
  PLATFORM: x64
  ZULUPLATFORM: x64
  PRODUCT: jre
  SEARCH_URL: https://api.adoptium.net/v3/installer/latest/%FEATUREVER%/ga/windows/%PLATFORM%/%PRODUCT%/hotspot/normal/adoptium
  ADDON_NAME: JavaFX
  VENDOR: 'Eclipse'
  PF_STRING: '_64'
  LANG_STRING: _ML

Process:
# - Processor: StopProcessingIf
  # Comment: Uses the Python eval function, It is assumed, that the Adopt-files are supplied earlier, when a new release is ready. If this changes, the predication has to be altered
  # Arguments:
    # predicate: (download_changed == False) or not __import__('os').path.isfile(__import__('os').path.join("%RECIPE_CACHE_DIR%\downloads","%DOWNLOAD_FILE%_zulu_%PLATFORM%.zip")) or not __import__('os').path.isfile(__import__('os').path.join("%RECIPE_CACHE_DIR%\downloads", "%DOWNLOAD_FILE%_hotspot_%PLATFORM%.msi"))

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourcepkt:sourceunzipped:release:read:helpers:wixproject:wixproject\%ADDON_NAME%:wixproject\Resources:wixproject\Lang
    org_ver: '%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%'
    pkg_dir: Adoptium_JRE_Hotspot%PF_STRING%_::VVeerrssiioonn::%LANG_STRING%
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\read\create-log-%FILENAME%%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%.txt'
    new_ver: '%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\read\readme-%FILENAME%%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%.txt'
    new_ver: '%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\sourceunzipped\%DOWNLOAD_FILE%_hotspot_%PLATFORM%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%.msi'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\release\%FILENAME%%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%.msi'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\sourcepkt\%zuludlfile%'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Arguments:
    exe_path: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\sourcepkt\%zuludlfile%'
    extract_dir: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\sourceunzipped'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileMoverFromList
  Arguments:
    file_list: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\helpers\Zulu-JFX-%PRODUCT%_%FEATUREVER%-%PLATFORM%.txt'
    source_dir: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\sourceunzipped\%zuludldir%'
    target_dir: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\wixproject\%ADDON_NAME%'


- Processor: com.github.NickETH.recipes.SharedProcessors/WixSettings
  Comment: Define variables for the WIX build process to the version.wxi file
  Arguments:
    preproc_file: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\wixproject\version.wxi'
    template_file: None
    new_settings:
    - define: 'version="%build_ver%"'
    - define: 'Packagecode="{NNEEWWGGUUIIDD}"'
    - define: 'ProductManufacturerLong="ETHZ ID-CD"'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSBuildRun
  Comment: Run the MSBuild script to generate the JFX MSM module addon.
  Arguments:
    build_file: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\wixproject\%ADDON_NAME%%PF_STRING%.build'
    build_folder: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\wixproject'
    build_property: BuildPlatform=%PLATFORM%;BuildName=%ADDON_NAME%;BuildDir=%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\wixproject;SourceDir=%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\wixproject\%ADDON_NAME%;version=%build_ver%;Platformstr=%PF_STRING%;LangStr=%LANG_STRING%
    build_target: WIX

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIimportMergeModule
  Arguments:
    log_file_abs: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\wixproject\MSM-log.txt'
    msi_path: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\release\%FILENAME%%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%.msi'
    msm_dir: INSTALLDIR
    msm_feature: FeatureJavaFX
    msm_path: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\wixproject\JavaFX%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%.msm'
    pkg_dir_abs: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%'
    temp_path: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\wixproject'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQL
  Arguments:
    SQL_command:
    - INSERT INTO `Feature` (`Feature`.`Feature`,`Feature`.`Feature_Parent`,`Feature`.`Title`,`Feature`.`Description`, `Feature`.`Display`,`Feature`.`Level`,`Feature`.`Directory_`,`Feature`.`Attributes`) VALUES ('FeatureJavaFX','FeatureMain','JavaFX','Install JavaFX',%FEATUREVER%,2,'INSTALLDIR',8)
    - UPDATE `Property` SET `Property`.`Value`='Adoptium Java RE Hotspot x64 %ver_major%.%ver_majorminor%.%ver_minor%.%ver_build% ML' WHERE `Property`.`Property`='ProductName'
    msi_path: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\release\%FILENAME%%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%.msi'

- Processor: com.github.haircut.processors/AppIconExtractor
  Arguments:
    ICON_PATH: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    #source_app: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\sourcepkt\%filename%'
    source_app: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\release\%FILENAME%%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%.msi'
    msi_icon_name: 'logo.ico'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIApplySumInfo
  Arguments:
    cmnds_sinfo:
      /j: Adoptium JRE Hotspot x64 %ver_major%.%ver_majorminor%.%ver_minor%.%ver_build% ML
      /o: Version %ver_major%.%ver_majorminor%.%ver_minor%.%ver_build% with JavaFX. %us_date% by AutoPkg
      /p: x64;1033
      /t: Adoptium JRE Hotspot x64 %ver_major%.%ver_majorminor%.%ver_minor%.%ver_build% ML
    msi_path: '%BUILD_DIR%\Adoptium_JRE_Hotspot%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%\release\%FILENAME%%PF_STRING%_%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%%LANG_STRING%.msi'

- Processor: EndOfCheckPhase
