Description: Imports SqlDeveloper to BMS
Identifier: com.github.NickETH.recipes.BMS.SqlDeveloper-Win64
ParentRecipe: com.github.NickETH.recipes.build.SqlDeveloper-Win64
MinimumVersion: 1.3.1

Input:
  NAME: SqlDeveloper
  VENDOR: Oracle
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _ML

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductCode'
    msi_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%\release\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.msi'

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%build_ver%'
    pattern_replace:
    - pattern: \.
      repl: _

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS)
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,1605,3010"
    bms_app_installcmd: '{DIP}\Apl\%NAME%\%parsed_string%\ML\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.msi'
    bms_app_installparm: /qn /norestart ALLUSERS=1
    bms_app_integration:
    - appname: '%NAME%'
      bundles:
      - action: exchange
        name: nV_SqlDeveloper
      - action: add
        name: aV_SqlDeveloper Uninstall
        version: new
      - action: add
        name: oV_SqlDeveloper Uninstall
        version: previous
      currentversion:
        bundle: nV_SqlDeveloper
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML (x64)'
        type: bundles
      platform: (x64)
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% ML'
    bms_app_iopt_copylocal: 'true'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'false'
    bms_app_iopt_usebbt: true
    bms_app_name: '%NAME%'
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: msiexec.exe
    bms_app_uninstparm: /x %msi_value% /qn /norestart
    bms_app_valid4os: Windows7_x64,Windows8_x64,Windows10_x64,WindowsServer2008R2_x64,WindowsServer2012_x64,WindowsServer2016_x64,WindowsServer2019_x64
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%build_ver% ML (x64)'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER3%'
    bms_username: '%BMS_USERNAME%'
    inst_file_src_dest: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%\release\*.ms?|%BMS_IMPORT_PATH_TST%\%NAME%\%parsed_string%\ML'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\%NAME%\bms_app_integration.json'
    read_file_src_dest: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%\read\*-%NAME%%PF_STRING%_%build_ver%_ML.txt|%BMS_IMPORT_PATH_TST%\%NAME%\%parsed_string%\DEV'

- Processor: EndOfCheckPhase
