Description: Imports ZoomClient to BMS
Identifier: com.github.NickETH.recipes.BMS.ZoomClient-Win64
ParentRecipe: com.github.NickETH.recipes.build.ZoomClient-Win64
MinimumVersion: 1.3.1

Input:
  NAME: ZoomClient
  NAMELONG: 'Zoom Client'
  VENDOR: Zoom Software
  PLATFORM: x64
  PF_STRING: _64
  DOWNLOAD_URL: https://www.zoom.us/client/latest/ZoomInstallerFull.msi?archType=%PLATFORM%

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductCode'
    msi_path: '%BUILD_DIR%\ZoomClient%PF_STRING%_%msi_value%_ML\release\%NAME%%PF_STRING%_%build_ver%_ML.msi'

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%build_ver%'
    pattern_replace:
    - pattern: \.
      repl: _

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS)
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,1605,3010"
    bms_app_installcmd: '{DIP}\Apl\%NAME%\%parsed_string%\ML%PF_STRING%\%NAME%%PF_STRING%_%build_ver%_ML.msi'
    bms_app_installparm: /qn /norestart ALLUSERS=1 ZNoDesktopShortCut="true"
    bms_app_iopt_copylocal: 'true'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'false'
    bms_app_iopt_usebbt: true
    bms_app_name: ZoomClient
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: msiexec.exe
    bms_app_uninstparm: /x %msi_value% /qn
    bms_app_valid4os: '%BMS_OS4X64%,%BMS_OS4SRV%'
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%build_ver% ML (%PLATFORM%)'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME1%'
    inst_file_src_dest: '%BUILD_DIR%\ZoomClient%PF_STRING%_%msi_value%_ML\release\*.ms?|%BMS_IMPORT_PATH_TST%\%NAME%\%parsed_string%\ML%PF_STRING%'
    read_file_src_dest: '%BUILD_DIR%\ZoomClient%PF_STRING%_%msi_value%_ML\read\*-%NAME%%PF_STRING%_%build_ver%_ML.txt|%BMS_IMPORT_PATH_TST%\%NAME%\%parsed_string%\DEV'
    icon_file_src: '%BUILD_DIR%\ZoomClient%PF_STRING%_%msi_value%_ML\icons\*.*'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\%NAME%\bms_app_integration.json'
    bms_app_integration:
    - appname: '%NAME%'
      bundles:
      - action: exchange
        name: nV_ZoomClient
      - action: add
        name: aV_ZoomClient Uninstall
        version: new
      - action: add
        name: oV_ZoomClient Uninstall
        version: previous
      currentversion:
        bundle: nV_ZoomClient
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML (%PLATFORM%)'
        type: bundles
      platform: (%PLATFORM%)
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% ML'
    bms_app_sharepoint:
    - SW-List-Name: '%NAMELONG%'
      versionplatformtag: '%build_ver% ML (x86/x64)'
    bms_job_kiosk:
    - jobname: '%NAME%'
      substring: 'Taskkill'
      jobdescription: 'Zoom ist eine proprietäre Video-Telefonie Software. Damit lassen sich 1 zu 1 Anrufe, Video-Konferenzen, das Teilen des Bildschirms und auch das Aufzeichnen von Meetings tätigen.'
      autoenableapp: '%NAME% - Enable AutoUpdate'
      autoreleasejob: '@_AU-Rel_%NAME%'

- Processor: EndOfCheckPhase
