Description: Alters latest NoMachine Enterprise Client x64 Install-file for Windows.
Identifier: com.github.NickETH.recipes.build.NoMachineEnterpriseClient-Win64
ParentRecipe: com.github.NickETH.recipes.download.NoMachineEnterpriseClient-Win64
MinimumVersion: 1.3.1

Input:
  NAME: NoMachineEnterpriseClient
  VENDOR: NoMachine
  #DOWNLOAD_URL: 'https://downloads.nomachine.com/download/?id=18'
  PLATFORM: x64
  PF_STRING: _64

Process:

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%version%'
    pattern_replace:
    - pattern: _
      repl: '.'

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create a build enviroment to store the package
  Arguments:
    version: '%parsed_string%'
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: helpers:sourceunzipped:release:read
    org_ver: '%parsed_string%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::_ML'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '4'

- Processor: Copier
  Comment: Copy the NoMachineEnterpriseClient installer file to the release dir
  Arguments:
    destination_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%parsed_string%_ML\release\%NAME%%PF_STRING%_%build_ver%_ML.exe'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/InnoEditor
  Comment: Extract the NoMachine installer
  Arguments:
    inno_path: '%pathname%'
    workfolder: '%BUILD_DIR%\%NAME%%PF_STRING%_%parsed_string%_ML\sourceunzipped\'
    # inno_compiler: '*'
    ignore_errors: False
   
- Processor: com.github.haircut.processors/AppIconExtractor
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%NAME%%PF_STRING%_%parsed_string%_ML\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    source_app: '%BUILD_DIR%\%NAME%%PF_STRING%_%parsed_string%_ML\sourceunzipped\{app}\bin\nxplayer.exe'
    #msi_icon_name: 'MainExecutableIcon.ico'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%parsed_string%_ML\read\create-log-%NAME%%PF_STRING%_%parsed_string%_ML.txt'
    new_ver: '%parsed_string%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%parsed_string%_ML\read\readme-%NAME%%PF_STRING%_%parsed_string%_ML.txt'
    new_ver: '%parsed_string%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: EndOfCheckPhase
