Description: Alters latest MobaXterm Install-file for Windows.
Identifier: com.github.NickETH.recipes.build.MobaXterm-Win
ParentRecipe: com.github.NickETH.recipes.download.MobaXterm-Win
MinimumVersion: 1.3.1

Input:
  NAME: MobaXterm
  VENDOR: Mobatek
  DOWNLOAD_URL: https://mobaxterm.mobatek.net/download-home-edition.html
  PLATFORM: x86
  PF_STRING: ''

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the MobaXterm installer
  Arguments:
    exe_path: '%pathname%'
    extract_dir: '%RECIPE_CACHE_DIR%\downloads'
    extract_file: '*'
    ignore_pattern: ''
    preserve_paths: 'True'

- Processor: FileFinder
  Comment: Get the the name of the extracted MSI-File
  Arguments:
    pattern: '%RECIPE_CACHE_DIR%\downloads\*.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Comment: Get the ProductCode into the  msi_value variable for the BMS uninstall string
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductVersion'
    msi_path: '%found_filename%'

- Processor: PathDeleter
  Comment: Delete the MSI file from the CACHE download dir.
  Arguments:
    path_list: '%found_filename%'

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create a build enviroment to store the package
  Arguments:
    version: '%msi_value%'
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: helpers:sourceunzipped:release:read
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::_ML'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '4'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the MobaXterm installer
  Arguments:
    exe_path: '%pathname%'
    extract_dir: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\sourceunzipped\'
    extract_file: '*'
    ignore_pattern: ''
    preserve_paths: 'True'

# - Processor: FileFinder
  # Comment: Get the the name of the extracted MSI-File.
  # Arguments:
    # pattern: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\sourceunzipped\*.msi'

- Processor: Copier
  Comment: Copy the MobaXterm installer msi file to the release dir
  Arguments:
    destination_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\release\%NAME%%PF_STRING%_%version%_ML.MSI'
    overwrite: 'true'
    source_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\sourceunzipped\%found_basename%'

# - Processor: FileMover
  # Comment: Move the MobaXterm msi file to the release dir
  # Arguments:
    # target: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\release\%NAME%%PF_STRING%_%version%_ML.MSI'
    # source: '%found_filename%'

- Processor: FileFinder
  Comment: Get the the name of the extracted DAT-File
  Arguments:
    pattern: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\sourceunzipped\*.dat'

# - Processor: FileMover
  # Comment: Move the MobaXterm dat file to the release dir
  # Arguments:
    # target: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\release\%found_basename%'
    # source: '%found_filename%'

- Processor: Copier
  Comment: Copy the MobaXterm dat file to the release dir
  Arguments:
    destination_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\release\%found_basename%'
    overwrite: 'true'
    source_path: '%found_filename%'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIDbWorker
  Comment: Merges the WixFirewallCA-merge.msi with the main MSI-file
  Arguments:
    mode: -m
    msi_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\release\%NAME%%PF_STRING%_%version%_ML.MSI'
    workfile: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\helpers\WixFirewallCA-merge.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSITransformer
  Comment: Apply the per Computer transform to the Teams MSI
  Arguments:
    mode: -a
    msi_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\release\%NAME%%PF_STRING%_%version%_ML.MSI'
    mst_paths: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\helpers\MobaXtermFW.mst'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\read\create-log-%NAME%%PF_STRING%_%version%_ML.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\read\readme-%NAME%%PF_STRING%_%version%_ML.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.haircut.processors/AppIconExtractor
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    source_app: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\release\%NAME%%PF_STRING%_%version%_ML.MSI'
    msi_icon_name: 'MobaXterm.ico'
    composite_uninstall_path: '%ICON_PATH%/Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%/Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%/Icon-Install-%NAME%.png'
    
- Processor: EndOfCheckPhase
