Description: Downloads the latest PyMOL x64 installer for Windows.
Identifier: com.github.NickETH.recipes.download.PyMOL-Win64
MinimumVersion: 1.3.1

Input:
  NAME: PyMOL
  VENDOR: 'Schrodinger, Inc.'
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _EN

  SEARCH_URL: https://pymol.org/2/
  # https://storage.googleapis.com/pymol-storage/installers/PyMOL-3.1.4-Windows-x86_64.exe
  SEARCH_PATTERN: 'https://storage[.]googleapis[.]com/pymol-storage/installers/PyMOL.*exe'
  USER_AGENT: AutoPkg/2.7 (Windows NT 10.0; Win64; x64) curl/8.9

Process:
- Processor: URLTextSearcher
  Comment: Get the download link for the most recent release
  Arguments:
    re_pattern: '%SEARCH_PATTERN%'
    url: '%SEARCH_URL%'
    request_headers:
      user-agent: '%USER_AGENT%'
    
- Processor: URLDownloader
  Arguments:
    curl_opts:
    - -L
    filename: '%NAME%.exe'
    request_headers:
      user-agent: '%USER_AGENT%'
    url: '%match%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN="Schrodinger, Inc", O="Schrodinger, Inc", L=New York, S=New York, C=US, SERIALNUMBER=2509213, OID.2.5.4.15=Private Organization, OID.1.3.6.1.4.1.311.60.2.1.2=Delaware, OID.1.3.6.1.4.1.311.60.2.1.3=US
    input_path: '%pathname%'

- Processor: EndOfCheckPhase
