Description: Download recipe for GPG4Win.
Identifier: com.github.NickETH.recipes.download.GPG4Win-Win
MinimumVersion: 1.3.1

Input:
  NAME: GPG4Win
  VENDOR: gpg4win.org
  # URL: https://files.gpg4win.org/?C=M;O=D
  URL: https://files.gpg4win.org/
  CH_LST_DIR: '?C=M;O=D'
  SEARCH_URL: '(?s)(gpg4win-(?P<version>([0-9]+\.)*[0-9]+)\.exe)(?!.*(gpg4win-([0-9]+\.)*[0-9]+\.exe))'
  # SEARCH_URL: '(gpg4win-(?P<version>([0-9]+\.)*[0-9]+)\.exe)'
  USER_AGENT: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:134.0) like Gecko

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '%SEARCH_URL%'
    url: '%URL%'
    #url: '%URL%%CH_LST_DIR%'

- Processor: URLDownloader
  Arguments:
    url: '%URL%%match%'
    filename: '%NAME%.exe'
    request_headers:
      user-agent: '%USER_AGENT%'

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: E=code@g10code.com, CN=g10 Code GmbH, O=g10 Code GmbH, L=Erkrath, S=Nordrhein-Westfalen, C=DE
    input_path: '%pathname%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: EndOfCheckPhase
