Description: Alters latest VMware Tools MSI-file for Windows.
Identifier: com.github.NickETH.recipes.build.VMwareTools-Win64
ParentRecipe: com.github.NickETH.recipes.download.VMwareTools-Win
MinimumVersion: 1.3.1

Input:
  NAME: VmwareTools
  NAMELONG: 'Tools 4allVM'
  VENDOR: VMware
  PF_STRING: _64
  LANG_STRING: _ML
  PLATFORM: x64

Process:
- Processor: StopProcessingIf
  Comment: Uses the Python eval function, looking at download_changed
  Arguments:
    predicate: download_changed == False

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourcepkt:sourceunzipped:release:read
    org_ver: '%version%'
    pkg_dir: '%NAME%_64_::VVeerrssiioonn::%LANG_STRING%'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '3'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the MSI file from exe
  Arguments:
    archive_type: '#'
    exe_path: '%pathname%'
    extract_dir: '%BUILD_DIR%\%NAME%_64_%build_ver%%LANG_STRING%\sourceunzipped'
    extract_file: '*.msi'
    preserve_paths: 'False'
    recursive: 'True'

- Processor: FileFinder
  Comment: Get the filename of the extracted MSI file
  Arguments:
    pattern: '%BUILD_DIR%\%NAME%_64_%build_ver%%LANG_STRING%\sourceunzipped\*.msi'

- Processor: FileMover
  Comment: Move the MSI file to the release dir.
  Arguments:
    overwrite: 'true'
    source: '%found_filename%'
    target: '%BUILD_DIR%\%NAME%_64_%build_ver%%LANG_STRING%\release\%NAME%_64_%build_ver%%LANG_STRING%.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%_64_%build_ver%%LANG_STRING%\read\create-log-%NAME%_64_%build_ver%%LANG_STRING%.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%_64_%build_ver%%LANG_STRING%\read\readme-%NAME%_64_%build_ver%%LANG_STRING%.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: Copier
  Comment: Save a copy of the downloaded EXE to the build dir.
  Arguments:
    destination_path: '%BUILD_DIR%\%NAME%_64_%build_ver%%LANG_STRING%\sourcepkt\%match%'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIApplySumInfo
  Arguments:
    cmnds_sinfo:
      /j: '%NAME% %version% ML'
      /o: Version %version% for ETHZ ID. %us_date% by AutoPkg
      /t: '%NAME% %version% ML'
    msi_path: '%BUILD_DIR%\%NAME%_64_%build_ver%%LANG_STRING%\release\%NAME%_64_%build_ver%_ML.msi'

- Processor: EndOfCheckPhase
