Description: Alters latest VMware VM Remote Console installer for Windows.
Identifier: com.github.NickETH.recipes.build.VMwareVMRC-Win
ParentRecipe: com.github.NickETH.recipes.download.VMwareVMRC-Win
MinimumVersion: 1.3.1

Input:
  NAME: VMwareVMRC
  PLATFORM: x86
  VENDOR: VMware
  PF_STRING: ''
  LANG_STRING: _ML

Process:
- Processor: StopProcessingIf
  Comment: Uses the Python eval function, looking at download_changed
  Arguments:
    predicate: download_changed == False

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: release:read:helpers:sourceunzipped:sourcepkt
    org_ver: '%version%'
    pkg_dir: '%NAME%_::VVeerrssiioonn::%LANG_STRING%'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '3'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the MSI file from exe
  Arguments:
    exe_path: '%pathname%'
    extract_dir: '%BUILD_DIR%\%NAME%_%build_ver%%LANG_STRING%\sourcepkt'
    extract_file: VMware-VMRC-*.exe
    preserve_paths: 'False'
    recursive: 'True'

- Processor: FileFinder
  Comment: Get the full path to the downloaded installer
  Arguments:
    pattern: '%BUILD_DIR%\%NAME%_%build_ver%%LANG_STRING%\sourcepkt\VMware-VMRC-*.exe'

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN="VMware, Inc.", O="VMware, Inc.", L=Palo Alto, S=California, C=US, SERIALNUMBER=2853894, OID.2.5.4.15=Private Organization, OID.1.3.6.1.4.1.311.60.2.1.2=Delaware, OID.1.3.6.1.4.1.311.60.2.1.3=US
    input_path: '%found_filename%'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the MSI file from exe
  Arguments:
    archive_type: '#'
    exe_path: '%found_filename%'
    extract_dir: '%BUILD_DIR%\%NAME%_%build_ver%%LANG_STRING%\sourceunzipped'
    extract_file: '*.msi'
    preserve_paths: 'False'

- Processor: Copier
  Comment: Copy the VMRC msi file to the release dir
  Arguments:
    destination_path: '%BUILD_DIR%\%NAME%_%build_ver%%LANG_STRING%\release\%NAME%_%build_ver%%LANG_STRING%.msi'
    overwrite: 'true'
    source_path: '%BUILD_DIR%\%NAME%_%build_ver%%LANG_STRING%\sourceunzipped\*.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%_%build_ver%%LANG_STRING%\read\create-log-%NAME%_%build_ver%%LANG_STRING%.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%_%build_ver%%LANG_STRING%\read\readme-%NAME%_%build_ver%%LANG_STRING%.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIApplySumInfo
  Comment: Set the language and the description
  Arguments:
    cmnds_sinfo:
      /j: '%NAME% %version% ML'
      /o: Version %version% for ETHZ ID. %us_date% by AutoPkg
      /p: Intel;1033
      /t: '%NAME% %version% ML'
    msi_path: '%BUILD_DIR%\%NAME%_%build_ver%%LANG_STRING%\release\%NAME%_%build_ver%%LANG_STRING%.msi'

- Processor: EndOfCheckPhase
