Description: Download recipe for WinMerge.
Identifier: com.github.NickETH.recipes.download.WinMerge-Win64
MinimumVersion: 1.3.1

Input:
  NAME: WinMerge
  URL: https://winmerge.org/downloads/?lang=en
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: WinMerge-([0-9]+\.)*[0-9]+-x64-Setup\.exe
    github_repo: WinMerge/winmerge

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-x64.exe'

- Processor: EndOfCheckPhase

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=Takashi Sawanaka, O=Takashi Sawanaka, L=Chiba, S=Chiba, C=JP
    input_path: '%pathname%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False
