Description: Download recipe for OBS-Studio x64.
Identifier: com.github.NickETH.recipes.download.OBS-Studio-Win64
MinimumVersion: 1.3.1

Input:
  NAME: OBS-Studio
  URL: https://obsproject.com
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    #asset_regex: OBS-Studio-([0-9]+\.)*[0-9]+-Full-Installer-x64\.exe
    asset_regex: OBS-Studio-([0-9]+\.)*[0-9]+-Windows-Installer\.exe
    github_repo: obsproject/obs-studio

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-x64.exe'

- Processor: EndOfCheckPhase

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN="OBS Project, LLC", O="OBS Project, LLC", L=Sheridan, S=Wyoming, C=US, SERIALNUMBER=2023-001272252, OID.2.5.4.15=Private Organization, OID.1.3.6.1.4.1.311.60.2.1.2=Wyoming, OID.1.3.6.1.4.1.311.60.2.1.3=US
    input_path: '%pathname%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False
