Description: Package the current PDFill Free release.
Identifier: com.github.NickETH.recipes.build.PDFill-Free-Win64
ParentRecipe: com.github.NickETH.recipes.download.PDFill-Free-Win64
MinimumVersion: 1.3.1

Input:
  NAME: 'PDFill-Free'
  DOWNLOAD_URL: https://www.plotsoft.com/download/PDFill_FREE_PDF_Editor_Basic.msi
  VENDOR: 'PlotSoft LLC'
  PLATFORM: x64
  PF_STRING: '_64'
  LANG_STRING: _EN
  DIP_NAME: PDFill
  DIP_SUBDIR: EN

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Comment: Get the version of PDFill.exe into the  msi_value variable.
  Arguments:
    SQL_command: SELECT `Version` FROM `File` WHERE `FileName`='PDFill.exe'
    msi_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create a build enviroment to package the MSI
  Arguments:
    version: '%msi_value%'
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    create_AS_ver: 'True'
    folder_list: sourceunzipped:release:read:helpers
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::%LANG_STRING%'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '4'

- Processor: Copier
  Comment: Copy the Endnote installer file to the release dir
  Arguments:
    destination_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%\release\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.msi'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%\read\create-log-%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%\read\readme-%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

