Description: Alters latest Mindmanager x64 MSI-file for Windows.
Identifier: com.github.NickETH.recipes.build.MindManager-Win64
ParentRecipe: com.github.NickETH.recipes.download.MindManager-Win
MinimumVersion: 1.3.1

Input:
  NAME: MindManager
  SEARCH_URL: https://www.mindmanager.com/en/support/download-library/
  PLATFORM: Win64
  PF_DIGIT: '64'

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: release:read
    org_ver: '%parsed_string%'
    pkg_dir: '%NAME%_%PF_DIGIT%_::VVeerrssiioonn::_ML'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '3'

- Processor: Copier
  Comment: Save a copy of the downloaded MSI to the build dir.
  Arguments:
    destination_path: '%BUILD_DIR%\%NAME%_%PF_DIGIT%_%build_ver%_ML\release\%NAME%_%PF_DIGIT%_%build_ver%_ML.msi'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.haircut.processors/AppIconExtractor
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%NAME%_%PF_DIGIT%_%build_ver%_ML\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    #source_app: '%BUILD_DIR%\%NAME%_%PF_DIGIT%_%build_ver%_ML\sourcepkt\%filename%'
    source_app: '%stubpath%'
    #msi_icon_name: 'ARPPRODUCTICON.exe'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%_%PF_DIGIT%_%build_ver%_ML\read\create-log-%NAME%_%PF_DIGIT%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%_%PF_DIGIT%_%build_ver%_ML\read\readme-%NAME%_%PF_DIGIT%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: EndOfCheckPhase
