Description: Alters latest 7-Zip MSI-file for Windows.
Identifier: com.github.NickETH.recipes.build.7-Zip-Win
ParentRecipe: com.github.NickETH.recipes.download.7-Zip-MSI
MinimumVersion: 1.3.1

Input:
  NAME: 7-Zip
  VENDOR: Igor Pavlov
  PLATFORM: x64
  PF_STR_DL: ''

Process:
- Processor: StopProcessingIf
  Comment: Uses the Python eval function, looking at download_changed
  Arguments:
    predicate: download_changed == False

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: release:read
    org_ver: '%version%'
    pkg_dir: '%NAME%_::VVeerrssiioonn::_ML'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '2'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%_%build_ver%_ML\read\create-log-%NAME%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%_%build_ver%_ML\read\readme-%NAME%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%NAME%_%build_ver%_ML\release\%NAME%_64_%build_ver%_ML.msi'
    overwrite: 'true'
    source_path: '%RECIPE_CACHE_DIR%\downloads\%NAME%.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIApplySumInfo
  Arguments:
    cmnds_sinfo:
      /j: '%NAME% %version% ML'
      /o: 'Altered version for enterprise. %us_date% by AutoPkg'
      /t: '%NAME% %version% ML'
    msi_path: '%BUILD_DIR%\%NAME%_%build_ver%_ML\release\%NAME%_64_%build_ver%_ML.msi'

- Processor: EndOfCheckPhase
