Description: Alters latest 7-Zip x64 MSI-file for Windows.
Identifier: com.github.NickETH.recipes.build.7-Zip-Win64
ParentRecipe: com.github.NickETH.recipes.download.7-Zip-MSI
MinimumVersion: 1.3.1

Input:
  NAME: 7-Zip
  VENDOR: Igor Pavlov
  PLATFORM: x64
  PF_STR_DL: '-x64'
  PF_STRING: _64

Process:
- Processor: StopProcessingIf
  Comment: Uses the Python eval function, looking at download_changed
  Arguments:
    predicate: download_changed == False

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: release:read:sourceunzipped:helpers
    org_ver: '%version%'
    pkg_dir: '%NAME%_::VVeerrssiioonn::_ML'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '2'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%_%build_ver%_ML\read\create-log-%NAME%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%_%build_ver%_ML\read\create-log-%NAME%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%NAME%_%build_ver%_ML\release\%NAME%%PF_STRING%_%build_ver%_ML.msi'
    overwrite: 'true'
    source_path: '%RECIPE_CACHE_DIR%\downloads\%NAME%.msi'

# - Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  # Comment: Extract the InstantClient odbc zip archive
  # Arguments:
    # exe_path: '%BUILD_DIR%\%NAME%_%build_ver%_ML\release\%NAME%%PF_STRING%_%build_ver%_ML.msi'
    # extract_dir: '%BUILD_DIR%\%NAME%_%build_ver%_ML\sourceunzipped\'
    # extract_file: '_7zG.exe'
    # ignore_pattern: ''
    # preserve_paths: 'False'

- Processor: com.github.haircut.processors/AppIconExtractor
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%NAME%_%build_ver%_ML\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    # source_app: '%BUILD_DIR%\%NAME%_%build_ver%_ML\sourceunzipped\_7zG.exe'
    source_app: '%BUILD_DIR%\%NAME%_%build_ver%_ML\helpers\7-Zip_256.ico'
    # msi_icon_name: 'ProductIcon.ico'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIApplySumInfo
  Arguments:
    cmnds_sinfo:
      /j: '%NAME% %version% ML'
      /o: 'Altered version for enterprise. %us_date% by AutoPkg'
      /t: '%NAME% %version% ML'
    msi_path: '%BUILD_DIR%\%NAME%_%build_ver%_ML\release\%NAME%%PF_STRING%_%build_ver%_ML.msi'

- Processor: EndOfCheckPhase
