Description: Imports XnView full to BMS
Identifier: om.github.NickETH.recipes.BMS.XnView-Win
ParentRecipe: com.github.NickETH.recipes.build.XnView-Win
MinimumVersion: 1.3.1

Input:
  NAME: XnView
  VENDOR: 'Pierre Gougelet'
  PLATFORM: x86
  PF_STRING: ''
  LANG_STRING: _ML
  DIP_NAME: XnView
  DIP_SUBDIR: ML

Process:
# - Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  # Arguments:
    # input_string: '|'
    # pattern_replace:
    # - pattern: SSuubbssttiittuuttee
      # repl: '%parsed_string%&#92;ML&#92;%NAME%%PF_STRING%_%build_ver%_ML'

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    #input_string: '%parsed_string%'
    input_string: '|'
    pattern_replace:
    - pattern: ddaatteettiimmee
      repl: '%us_date% %time%'

- Processor: FileCreator
  Comment: Generate the install.bds in the release dir.
  Arguments:
    file_content: '%parsed_string%'
    file_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\release\u_%NAME%%PF_STRING%_%build_ver%.bds'

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%build_ver%'
    pattern_replace:
    - pattern: \.
      repl: _

- Processor: URLTextSearcher
  Arguments:
    re_pattern: AppVerName=(?P<DISPNAME>XnView.+)
    url: 'file://D:/AutoPkg/Build/%NAME%%PF_STRING%_%build_ver%%LANG_STRING%/sourceunzipped/install_script.iss'

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS)
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,1605,3010"
    bms_app_installcmd: '{DIP}\Apl\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.exe'
    bms_app_installparm: /ALLUSERS /NORESTART /TYPE="full" /MERGETASKS="!desktopicon" /SP- /SUPPRESSMSGBOXES /VERYSILENT
    bms_app_localfilecopy:
    - '{DIP}\Apl\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%\~~~FolderWithSubFolders'
    bms_app_integration:
    - appname: '%NAME%'
      bundles:
      - action: exchange
        name: nV_%NAME%
      - action: add
        name: aV_%NAME% Uninstall
        version: new
      - action: add
        name: oV_%NAME% Uninstall
        version: previous
      copyfolders: 1
      currentversion:
        bundle: nV_%NAME%
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML'
        type: bundles
      platform: ''
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% ML'
      SWDetectionRules:
      - Name: '%DISPNAME%'
        Vendor: 'Pierre-e Gougelet'
        Version: '%build_ver%'
        #Language: "1033"
        PathType: "2"
        RegKey: 'XnView_is1'
        ApplyMode: "0"
        Category: "baramundi Application"
        Comments: ''
    bms_app_sharepoint:
    - SW-List-Name: '%NAME%'
      versionplatformtag: '%build_ver% ML'
    # bms_job_kiosk:
    # - jobname: '%NAME%'
      # substring: 'Taskkill'
      # jobdescription: 'XnView is an image organizer and general-purpose file manager used for viewing, converting, organizing and editing raster images.'
      # autoenableapp: '%NAME% - Enable AutoUpdate'
      # autoreleasejob: '@_AU-Rel_%NAME%'
    bms_app_iopt_copylocal: 'true'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'false'
    bms_app_iopt_usebbt: true
    bms_app_name: '%NAME%'
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    # bms_app_uninstcmd: '"{%ProgramW6432%}\GIMP 2\uninst\unins000.exe"'
    # bms_app_uninstparm: /VERYSILENT /NORESTART
    bms_app_uninstbds: '{DIP}\Apl\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%\u_%NAME%%PF_STRING%_%build_ver%.bds'
    bms_app_valid4os: '%BMS_OS4X64%,%BMS_OS4SRV%'
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%build_ver% ML'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME1%'
    inst_file_src_dest: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\release\*.*|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\%DIP_NAME%\bms_app_integration.json'
    icon_file_src: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\icons\*.*'
    read_file_src_dest: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\read\*-%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.txt|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%parsed_string%\DEV'

- Processor: EndOfCheckPhase
