Description: Alters latest Dropbox x86 client for Windows.
Identifier: com.github.NickETH.recipes.build.DropboxClient-Win
ParentRecipe: com.github.NickETH.recipes.download.DropboxClient-Win
MinimumVersion: 1.3.1

Input:
  NAME: DropboxClient
  DOWNLOAD_URL: https://www.dropbox.com/download?full=1&plat=win
  VENDOR: 'Dropbox, Inc'
  PF_STRING: ''
  LANG_STRING: _ML
  PLATFORM: x86

Process:
- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Arguments:
    exe_path: '%pathname%'
    extract_dir: '%RECIPE_CACHE_DIR%\downloads'
    extract_file: DropboxClientInstaller.exe*

- Processor: FileFinder
  Arguments:
    pattern: '%RECIPE_CACHE_DIR%\downloads\DropboxClientInstaller.exe*'

- Processor: com.github.NickETH.recipes.SharedProcessors/WinPEVersionExtractor
  Arguments:
    exe_path: '%found_filename%'

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourcepkt:sourceunzipped:release:read
    org_ver: '%version%'
    pkg_dir: '%NAMESHORT%%PF_STRING%_::VVeerrssiioonn::%LANG_STRING%'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '4'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%NAMESHORT%%PF_STRING%_%build_ver%%LANG_STRING%\sourceunzipped\Dropbox-Innner-installer.exe'
    overwrite: 'true'
    source_path: '%found_filename%'

- Processor: Copier
  Arguments:
    # destination_path: '%BUILD_DIR%\%NAMESHORT%%PF_STRING%_%build_ver%%LANG_STRING%\sourceunzipped\Dropbox-Innner-installer.exe'
    overwrite: 'true'
    source_path: '%found_filename%'
    destination_path: '%BUILD_DIR%\%NAMESHORT%%PF_STRING%_%build_ver%%LANG_STRING%\release\%NAME%%PF_STRING%_%version%%LANG_STRING%.exe'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%NAMESHORT%%PF_STRING%_%build_ver%%LANG_STRING%\sourcepkt\DropboxOfflineInstaller-%version%.exe'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Arguments:
    exe_path: '%BUILD_DIR%\%NAMESHORT%%PF_STRING%_%build_ver%%LANG_STRING%\release\%NAME%%PF_STRING%_%version%%LANG_STRING%.exe'
    extract_dir: '%BUILD_DIR%\%NAMESHORT%%PF_STRING%_%build_ver%%LANG_STRING%\release\'
    extract_file: $0\DropboxUninstaller.exe
    preserve_paths: 'False'

- Processor: com.github.haircut.processors/AppIconExtractor
  Comment: Generate Icon files for the Kiosk from Telegraf
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%NAMESHORT%%PF_STRING%_%build_ver%%LANG_STRING%\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    source_app: '%BUILD_DIR%\%NAMESHORT%%PF_STRING%_%build_ver%%LANG_STRING%\release\%NAME%%PF_STRING%_%version%%LANG_STRING%.exe'
    #msi_icon_name: 'MainExecutableIcon.ico'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'                                                          

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAMESHORT%%PF_STRING%_%build_ver%%LANG_STRING%\read\Create-log-%NAMESHORT%%PF_STRING%_%version%%LANG_STRING%.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAMESHORT%%PF_STRING%_%build_ver%%LANG_STRING%\read\readme-%NAMESHORT%%PF_STRING%_%version%%LANG_STRING%.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: EndOfCheckPhase
