Description: Downloads the latest Google Earth Pro for Windows x64.
Identifier: com.github.NickETH.recipes.download.GoogleEarthPro-Win64
MinimumVersion: 1.3.1

Input:
  NAME: GoogleEarthPro
  DOWNLOAD_URL: https://dl.google.com/dl/earth/client/advanced/current/googleearthprowin-x64.exe

Process:
- Processor: URLDownloader
  Arguments:
    filename: GoogleEarthPro64.exe
    url: '%DOWNLOAD_URL%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: EndOfCheckPhase

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: 'CN=Google LLC, O=Google LLC, L=Mountain View, S=California, C=US, SERIALNUMBER=3582691, OID.2.5.4.15=Private Organization, OID.1.3.6.1.4.1.311.60.2.1.2=Delaware, OID.1.3.6.1.4.1.311.60.2.1.3=US'
    input_path: '%pathname%'
