Description: Alters latest Google Google Earth Pro x64 MSI-file for Windows.
Identifier: com.github.NickETH.recipes.build.GoogleEarthPro-Win64
ParentRecipe: com.github.NickETH.recipes.download.GoogleEarthPro-Win64
MinimumVersion: 1.3.1

Input:
  NAME: GoogleEarthPro
  NAMELONG: 'Google Earth Pro'
  DOWNLOAD_URL: https://dl.google.com/dl/earth/client/advanced/current/googleearthprowin-x64.exe
  # PLATFORM: Win64
  VENDOR: Google
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _ML

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/ResourceWorker
  Comment: Extract the Google Earth Pro MSI file
  Arguments:
    exe_path: '%pathname%'
    output_file: '%RECIPE_CACHE_DIR%\downloads\%NAME%-%PLATFORM%.msi'
    reswork_action: 'extract'
    reswork_cmd: 'BINARY,ID_MSI,'
    # ignore_errors: 'True'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductVersion'
    msi_path: '%RECIPE_CACHE_DIR%\downloads\%NAME%-%PLATFORM%.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    version: '%msi_value%'
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourcepkt:release:read
    org_ver: '%msi_value%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::%LANG_STRING%'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '4'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\sourcepkt\GoogleEarthPro-%PLATFORM%.exe'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\release\%NAME%%PF_STRING%_%msi_value%%LANG_STRING%.msi'
    overwrite: 'true'
    source_path: '%RECIPE_CACHE_DIR%\downloads\%NAME%-%PLATFORM%.msi'

# - Processor: com.github.NickETH.recipes.SharedProcessors/MSITransformer
  # Comment: Applies the Settings-Transform to the GoogleChrome.msi in the release folder
  # Arguments:
    # mode: -a
    # msi_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\release\%NAME%%PF_STRING%_%msi_value%%LANG_STRING%.msi'
    # mst_paths: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\helpers\GChrome64_Enterprise_byAutoPkg.mst'

- Processor: com.github.haircut.processors/AppIconExtractor
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    #source_app: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\sourcepkt\%filename%'
    source_app: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\release\%NAME%%PF_STRING%_%msi_value%%LANG_STRING%.msi'
    #msi_icon_name: 'MainExecutableIcon.ico'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\read\create-log-%NAME%%PF_STRING%_%msi_value%%LANG_STRING%.txt'
    new_ver: '%msi_value%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\read\readme-%NAME%%PF_STRING%_%msi_value%%LANG_STRING%.txt'
    new_ver: '%msi_value%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: EndOfCheckPhase
