Description: Downloads latest WhatsApp Desktop for Windows x64 MS Store App
Identifier: com.github.NickETH.recipes.download.WhatsAppDesktop-Win64
MinimumVersion: 1.3.1

Input:
  NAME: 'WhatsAppDesktop'
  APP_URL: https://apps.microsoft.com/detail/9nksqgp7f2nh?hl=en-US&gl=CH
  APPNAME: '5319275A.WhatsAppDesktop'
  PRODUCTID: '9nksqgp7f2nh'
  USER_AGENT: Mozilla/5.0 (Windows NT 6.3; Win64, x64; Trident/7.0; rv:11.0) like Gecko
  # 5319275A.WhatsAppDesktop_2.2605.3.0_neutral_~_cv1g1gvanyjgm_397a9da3-5d22-4acd-a9da-c5ee56411123.msixbundle
  #SEARCH_STR: 5319275A.WhatsAppDesktop_(?P<version>(?:[0-9]+\.)*[0-9]+)_neutral_.*?\.msixbundle
  SEARCH_STR: 5319275A.WhatsAppDesktop_(([0-9]+\.)*[0-9]+)_neutral_.*?\.msixbundle

Process:

- Processor: com.github.NickETH.recipes.SharedProcessors/MSStoreAppGet
  Arguments:
    #app_url: 'https://apps.microsoft.com/detail/9nksqgp7f2nh'
    app_url: '%APP_URL%'
    dl_dir: 'none'
    dl_file: "WhatsAppDesktop.msixbundle"
    dl_arch: "x64"
    re_pattern: '%SEARCH_STR%'

# - Processor: com.github.jazzace.processors/TextSearcher
  # Arguments:
    # re_pattern: '%SEARCH_STR%'
    # text_in: '%main_file%'
    # result_output_var_name: version

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.msixbundle'
    url: '%file_list%'

- Processor: EndOfCheckPhase

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=24803D75-212C-471A-BC57-9EF86AB91435
    input_path: '%pathname%'
    
- Processor: com.github.NickETH.recipes.SharedProcessors/MSStoreAppGet
  Arguments:
    app_url: 'https://apps.microsoft.com/detail/9nksqgp7f2nh'
    dl_dir: '%RECIPE_CACHE_DIR%/download_full'
    dl_file: "none"
    dl_deps: required
    dl_arch: "x64"

