Description: Downloads latest Adobe Reader DC Update MSP-file for Windows.
Identifier: com.github.NickETH.recipes.download.AdobeReaderDCMSI-Win
MinimumVersion: 1.3.1

Input:
  NAME: AdobeReaderDC
  SEARCH_URL: https://www.adobe.com/devnet-docs/acrobatetk/tools/ReleaseNotesDC/index.html
  SEARCH_PATTERN: /AcroRdrDCUpd(?P<version_string>(?P<ver_major>[0-9]{2})(?P<ver_majorminor>[0-9]{3})(?P<ver_minor>[0-9]{5}))\.msp
  DOWNLOAD_FILE: AdobeReaderDCUpd.msp

Process:
- Processor: URLTextSearcher
  Comment: Get the most recent release notes page
  Arguments:
    # See: https://www.rexegg.com/regex-best-trick.php#thetrick
    # And: https://wyssmann.com/blog/2021/03/regular-expression-ignore-or-exclude-a-specific-word-find-everything-else/
    # We need to make sure, that the left side finds something. But this is not given back, since it is negative.
    re_pattern: continuous/dccontinuous.*?\.html.*?\d \((?!Mac only)\)\<\/span\>|(continuous/dccontinuous.*?\.html).*?\d\<\/span\>
    #re_pattern: continuous/.*\.html
    re_flags: 
    - MULTILINE
    url: '%SEARCH_URL%'

- Processor: URLTextSearcher
  Comment: Read out link and version from the release notes page
  Arguments:
    re_pattern: /AcroRdrDCUpd(?P<version_string>(?P<ver_major>[0-9]{2})(?P<ver_majorminor>[0-9]{3})(?P<ver_minor>[0-9]{5}))\.msp
    url: https://www.adobe.com/devnet-docs/acrobatetk/tools/ReleaseNotesDC/%match%

- Processor: URLDownloader
  Arguments:
    CHECK_FILESIZE_ONLY: 'False'
    filename: '%DOWNLOAD_FILE%'
    url: https://ardownload2.adobe.com/pub/adobe/reader/win/AcrobatDC/%version_string%/AcroRdrDCUpd%version_string%.msp

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=Adobe Inc., OU=Acrobat DC, O=Adobe Inc., L=San Jose, S=ca, C=US, SERIALNUMBER=2748129, OID.2.5.4.15=Private Organization, OID.1.3.6.1.4.1.311.60.2.1.2=Delaware, OID.1.3.6.1.4.1.311.60.2.1.3=US
    input_path: '%pathname%'

- Processor: EndOfCheckPhase
