Description: Imports Adobe AIR client for Windows to BMS
Identifier: com.github.NickETH.recipes.BMS.AdobeAIR-Win
ParentRecipe: com.github.NickETH.recipes.build.AdobeAIR-Win
MinimumVersion: 1.3.1

Input:
  NAME: AdobeAIR
  NAMELONG: 'Adobe AIR'
  NAMEL2: Adobe_AIR
  VENDOR: Harman
  PLATFORM: x86
  PF_STRING: ''
  LANG_STRING: _ENU
  DIP_NAME: Adobe_AIR
  DIP_SUBDIR: EN

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductCode'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAMEL2%%PF_STRING%_%build_ver%%LANG_STRING%.msi'

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%build_ver%'
    pattern_replace:
    - pattern: \.
      repl: _

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS)
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,1641,3010\r\nDeinstall.CheckAppRC=0,1605,1641,3010"
    bms_app_installcmd: '{DIP}\Apl\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%\%NAMEL2%%PF_STRING%_%build_ver%%LANG_STRING%.msi'
    bms_app_installparm: /qn /norestart ALLUSERS=1
    bms_app_integration:
    - appname: '%NAMELONG%'
      bundles:
      - action: exchange
        name: nV_%NAMELONG%
      - action: add
        name: aV_%NAMELONG% Uninstall
        version: new
      - action: add
        name: oV_%NAMELONG% Uninstall
        version: previous
      copyfolders: 1
      currentversion:
        bundle: nV_%NAMELONG%
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML (%PLATFORM%)'
        type: bundles
      platform: ''
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% EN'
    bms_app_sharepoint:
    - SW-List-Name: '%NAMELONG%'
      versionplatformtag: '%build_ver% EN'
    bms_app_iopt_copylocal: 'true'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'false'
    bms_app_iopt_usebbt: true
    bms_app_name: '%NAME%'
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: msiexec.exe
    bms_app_uninstparm: /x %msi_value% /qn /norestart
    bms_app_valid4os: '%BMS_OS4X64%,%BMS_OS4SRV%'
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%build_ver% EN'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME1%'
    inst_file_src_dest: '%BUILD_DIR%\%pkg_dir%\release\*.ms?|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%'
    #icon_file_src: '%BUILD_DIR%\%pkg_dir%\icons\*.*'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\%DIP_NAME%\bms_app_integration.json'
    read_file_src_dest: '%BUILD_DIR%\%pkg_dir%\read\*-%NAME%%PF_STRING%_%build_ver%_ML.txt|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%parsed_string%\DEV'

- Processor: EndOfCheckPhase
