Description: Alters latest Microsoft PowerToys Install-file for Windows.
Identifier: com.github.NickETH.recipes.build.MicrosoftPowerToys-Win64
ParentRecipe: com.github.NickETH.recipes.download.MicrosoftPowerToys-Win64
MinimumVersion: 1.3.1

Input:
  NAME: PowerToys
  VENDOR: Microsoft
  GITHUB_REPO: microsoft/PowerToys
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create a build enviroment to store the package
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourcepkt:sourceunzipped:release:read
    org_ver: '%version%'
    pkg_dir: '%VENDOR%_%NAME%%PF_STRING%_::VVeerrssiioonn::_ML'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '3'

- Processor: Copier
  Comment: Copy the Git install exe file to the sourcepkt dir
  Arguments:
    destination_path: '%BUILD_DIR%\%VENDOR%_%NAME%%PF_STRING%_%version%_ML\sourcepkt\%VENDOR%_%NAME%%PF_STRING%_%version%_ML.exe'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/WixDarkExtractor
  Comment: Extract the MSI-file from install exe file to the sourceunzipped dir, using Wix dark
  Arguments:
    exe_path: '%BUILD_DIR%\%VENDOR%_%NAME%%PF_STRING%_%version%_ML\sourcepkt\%VENDOR%_%NAME%%PF_STRING%_%version%_ML.exe'
    extract_dir: '%BUILD_DIR%\%VENDOR%_%NAME%%PF_STRING%_%version%_ML\sourceunzipped'

- Processor: FileFinder
  Comment: Find the exact path to extracted MSI-file
  Arguments:
    pattern: '%BUILD_DIR%\%VENDOR%_%NAME%%PF_STRING%_%version%_ML\sourceunzipped\**\*.msi'

- Processor: Copier
  Comment: Copy the extracted MSI-file to the release dir
  Arguments:
    destination_path: '%BUILD_DIR%\%VENDOR%_%NAME%%PF_STRING%_%version%_ML\release\%VENDOR%_%NAME%%PF_STRING%_%version%_ML.msi'
    overwrite: 'true'
    source_path: '%found_filename%'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%VENDOR%_%NAME%%PF_STRING%_%version%_ML\read\create-log-%VENDOR%_%NAME%%PF_STRING%_%version%_ML.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%VENDOR%_%NAME%%PF_STRING%_%version%_ML\read\readme-%VENDOR%_%NAME%%PF_STRING%_%version%_ML.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: EndOfCheckPhase
