Description: Alters latest Teams MSI-file for Windows.
Identifier: com.github.NickETH.recipes.build.Teams-Win64
ParentRecipe: com.github.NickETH.recipes.download.Teams-Win64
MinimumVersion: 1.3.1

Input:
  NAME: Teams
  VENDOR: Microsoft
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Comment: Get the version from Teams.msi into msi_value
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductVersion'
    msi_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create the build environment
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: helpers:release:read
    org_ver: '%msi_value%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::_ML'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '4'

- Processor: Copier
  Comment: Save a copy of the downloaded MSI to the release dir.
  Arguments:
    destination_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\release\%NAME%%PF_STRING%_%build_ver%_ML.msi'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: Copier
  Comment: Save an extra copy of the downloaded MSI to the release dir for the per computer install.
  Arguments:
    destination_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\release\%NAME%-perComp%PF_STRING%_%build_ver%_ML.msi'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIDbWorker
  Comment: Merges the WixFirewallCA-merge.msi with the main MSI-file
  Arguments:
    mode: -m
    msi_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\release\%NAME%-perComp%PF_STRING%_%build_ver%_ML.msi'
    workfile: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\helpers\WixFirewallCA-merge.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIDbWorker
  Comment: Import the Upgrade Table into the Teams MSI-file
  Arguments:
    mode: -i
    msi_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\release\%NAME%-perComp%PF_STRING%_%build_ver%_ML.msi'
    workfile: Upgrade
    workfolder: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\helpers'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQL
  Comment: Set the Upgrade and Property table entries for the upgrade code in the Teams MSI-file
  Arguments:
    SQL_command:
    - INSERT INTO `Upgrade` (`Upgrade`.`UpgradeCode`,`Upgrade`.`VersionMin`,`Upgrade`.`VersionMax`,`Upgrade`.`Attributes`, `Upgrade`.`ActionProperty`) VALUES ('{57602353-1593-497F-B8D1-6A53F86E2760}','0.0.0.0','%build_ver%',768,'UPGRADEFOUND')
    - UPDATE `Property` SET `Property`.`Value`='NETFRAMEWORK45;UPGRADEFOUND' WHERE `Property`.`Property`='SecureCustomProperties'
    msi_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\release\%NAME%-perComp%PF_STRING%_%build_ver%_ML.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSITransformer
  Comment: Apply the per Computer transform to the Teams MSI
  Arguments:
    mode: -a
    msi_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\release\%NAME%-perComp%PF_STRING%_%build_ver%_ML.msi'
    mst_paths: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\helpers\teams_perComp_x64.mst'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSITransformer
  Comment: Apply the per User transform to the Teams MSI
  Arguments:
    mode: -a
    msi_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\release\%NAME%%PF_STRING%_%build_ver%_ML.msi'
    mst_paths: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\helpers\teams_perUser_x64.mst'
    
- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\read\create-log-%NAME%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\read\readme-%NAME%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: EndOfCheckPhase
