Description: Alters latest Git Extensions x64 MSI-file for Windows.
Identifier: com.github.NickETH.recipes.build.GitExtensions-Win64
ParentRecipe: com.github.NickETH.recipes.download.GitExtensions-Win64
MinimumVersion: 1.3.1

Input:
  NAME: GitExtensions
  VENDOR: 'Git Extensions Team'
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _ML

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create the build environment
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: release:read:sourceunzipped:helpers
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::%LANG_STRING%'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '3'

- Processor: Copier
  Comment: Save a copy of the downloaded MSI to the release dir.
  Arguments:
    destination_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%\release\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.msi'
    overwrite: 'true'
    source_path: '%pathname%'

# - Processor: Copier
  # Comment: Save a copy of the corporate MST to the release dir.
  # Arguments:
    # destination_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%\release\PDF24_Enterprise_byAutoPkg.mst'
    # overwrite: 'true'
    # source_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%\helpers\PDF24_Enterprise_byAutoPkg.mst'
    
- Processor: com.github.haircut.processors/AppIconExtractor
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    source_app: '%pathname%'
    msi_icon_name: 'gitextensions.ico'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%\read\create-log-%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%\read\readme-%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: EndOfCheckPhase
